{"name": "Fire TV Stick 4K streaming device with latest Alexa Voice Remote (includes TV controls), Dolby Vision", "price": null, "short_description": "Cinematic experience - Watch in vibrant 4K Ultra HD with support for Dolby Vision, HDR, and HDR10+. Home theater audio with Dolby Atmos - Feel scenes come to life with support for immersive Dolby Atmos audio on select titles with compatible home audio systems. Endless entertainment - Stream more than 1 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply. Live and free TV - Watch live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Stream for free with Pluto TV, IMDb TV, YouTube and more. Alexa Voice Remote - Search and launch content with your voice. Get to favorite apps quickly with preset buttons. Control power and volume with one remote. Control your smart home - Ask Alexa to check weather, dim the lights, view live camera feeds, stream music and more. Simple and intuitive - Quickly access your favorite apps, live TV, and things you use most, all from the main menu. Easy to set up, compact enough to stay hidden - Plug in behind your TV, turn on the TV, and connect to the internet to get set up.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/all-new-fire-tv-stick-4k-with-alexa-voice-remote/product-reviews/B08XVYZ1Y5/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (4th Gen, 2020 release) | Smart speaker with Alexa | Charcoal", "price": null, "short_description": "Meet the Echo Dot - Our most popular smart speaker with Alexa. The sleek, compact design delivers crisp vocals and balanced bass for full sound. Voice control your entertainment - Stream songs from Amazon Music, Apple Music, Spotify, SiriusXM, and others. Play music, audiobooks, and podcasts throughout your home with multi-room music. Ready to help - Ask Alexa to tell a joke, play music, answer questions, play the news, check the weather, set alarms, and more. Control your smart home - Use your voice to turn on lights, adjust thermostats, and lock doors with compatible devices. Start Routines with your motion - Turn on compatible lights, play your Flash Briefing, or turn on the coffee maker when you walk into the room. Connect with others hands-free - Call friends and family who have the Alexa app or an Echo device. Instantly drop in on other rooms or announce to the whole house that dinner's ready. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic off button.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/all-new-Echo-Dot/product-reviews/B07XJ8C8F5/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Fire TV Stick with Alexa Voice Remote (includes TV controls), HD streaming device", "price": null, "short_description": "Latest generation of our best-selling Fire TV device - 50% more powerful than the 2nd generation for fast streaming in Full HD. Includes Alexa Voice Remote with power and volume buttons. Endless entertainment - Stream more than 1 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply. Live TV - Watch your favorite live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Use the Guide button to see what's available and when. Free TV - Access over 200,000 free movies and TV episodes from popular ad-supported streaming apps like IMDb TV, Tubi, Pluto TV and more. Listen to music - Stream on Amazon Music, Spotify, Pandora, and others. Subscription fees may apply. Less clutter, more control - Alexa Voice Remote lets you use your voice to search and launch shows across apps. All-new preset buttons get you to favorite apps quickly. Plus, control power and volume on your TV and soundbar with a single remote. Home theater audio with Dolby Atmos - Feel scenes come to life with immersive Dolby Atmos audio on select titles with compatible home audio systems. Easy to set up, stays hidden - Plug in behind your TV, turn on the TV, and connect to the internet to get set up. Certified for Humans - Struggle-free, tinker-free, and stress-free. No patience needed—it's actually simple. Show more", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/fire-tv-stick-with-3rd-gen-alexa-voice-remote/product-reviews/B08C1W5N87/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (4th Gen) | Smart speaker with clock and Alexa | Glacier White", "price": null, "short_description": "Meet Echo Dot with clock - Our most popular smart speaker with Alexa. The sleek, compact design delivers crisp vocals and balanced bass for full sound. Perfect for your nightstand - See the time, alarms, and timers on the LED display. Tap the top to snooze an alarm. Ready to help - Ask Alexa to tell a joke, play music, answer questions, play the news, check the weather, set alarms, and more. Control your smart home - Use your voice to turn on lights, adjust thermostats, and lock doors with compatible devices. Start Routines with your motion - Turn on compatible lights, play your Flash Briefing, or turn on the coffee maker when you walk into the room. Connect with others hands-free - Call friends and family who have the Alexa app or an Echo device. Instantly drop in on other rooms or announce to the whole house that dinner's ready. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic off button.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/All-New-Echo-Dot-4th-Gen/product-reviews/B07XJ8C8F7/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Blink Video Doorbell + Sync Module 2 | Two-way audio, HD video, motion and chime app alerts and Alexa enabled — wired or wire-free (Black)", "price": null, "short_description": "Answer your door anytime, anywhere from your smartphone with 1080p HD day and infrared night video and two-way audio. Experience up to two years of powerful battery life, custom alerts, privacy settings, and more. Choose to save and share clips in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the included Sync Module 2 and USB drive (sold separately). Designed for every home, go wire-free or connect to existing doorbell wiring to also sound in-home chime. Set up yourself in minutes with the two included AA lithium batteries then connect to wifi in the app. Works with Alexa — access live view, two-way talk, receive motion and chime alerts, arm and disarm your doorbell, and more. Includes one Video Doorbell, one Sync Module 2, and mounting kit (including corner mount, screws, and anchors).", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Introducing-Blink-Doorbell-Two-way-enabled/product-reviews/B08SGC46M9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Blink Mini – Compact indoor plug-in smart security camera, 1080 HD video, night vision, motion detection, two-way audio, Works with Alexa – 2 cameras", "price": null, "short_description": "1080P HD indoor, plug-in security camera with motion detection and two way audio that lets you monitor the inside of your home day and night. Get alerts on your smartphone whenever motion is detected or customize motion detection zones so you can see what matters most. Store events conveniently and securely in the cloud with a 30-day free trial of the Blink Subscription Plan or locally with the Sync Module 2 and a USB flash drive (USB sold separately). See, hear, and speak to people and pets in your home on your smartphone with Blink Mini’s live view and two-way audio features (live view is not continuous). Sets up in minutes – just plug in the camera, connect it to wifi, and add it to your Blink app. For additional ease of use, pair Blink Mini with a supported Alexa-enabled device to engage live view, and arm and disarm your camera, and more using just your voice.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Blink-Mini-Security-Camera-2-Pack/product-reviews/B07X27VK3D/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (3rd Gen, 2018 release) - Smart speaker with Alexa - Charcoal", "price": null, "short_description": "Meet Echo Dot - Our most compact smart speaker that fits perfectly into small spaces. Improved speaker quality - Better speaker quality than Echo Dot Gen 2 for richer and louder sound. Pair with a second Echo Dot for stereo sound. Voice control your music - Stream songs from Amazon Music, Apple Music, Spotify, Sirius XM, and others. Ready to help - Ask Alexa to play music, answer questions, read the news, check the weather, set alarms, control compatible smart home devices, and more. Voice control your smart home - Turn on lights, adjust thermostats, lock doors, and more with compatible connected devices. Create routines to start and end your day. Connect with others hands-free - Call friends and family who have the Alexa app or an Echo device. Instantly drop in on other rooms in your home or make an announcement to every room with a compatible Echo device. Alexa has skills - With tens of thousands of skills and counting, Alexa is always getting smarter and adding new skills like tracking fitness, playing games, and more. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic off button.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Echo-Dot/product-reviews/B07FZ8S74R/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Ring Video Doorbell – see who’s there from anywhere – newest generation, 2020 release – Satin Nickel", "price": null, "short_description": "1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC. An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision. Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors. Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power. Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools. With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 60 days, and share videos and photos. Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Ring-Video-Doorbell-Satin-Nickel-2020-Release/product-reviews/B08N5NQ869/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Fire TV Stick 4K Max streaming device, Wi-Fi 6, Alexa Voice Remote (includes TV controls)", "price": null, "short_description": "Our most powerful streaming stick - 40% more powerful than Fire TV Stick 4K, with faster app starts and more fluid navigation. Support for next-gen Wi-Fi 6 - Enjoy smoother 4K streaming across multiple Wi-Fi 6 devices. Cinematic experience - Watch in vibrant 4K Ultra HD with support for Dolby Vision, HDR, HDR10+ and immersive Dolby Atmos audio. Endless entertainment - Stream more than 1 million movies and TV episodes. Watch favorites from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply. Live and free TV - Watch live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Stream for free with IMDb TV, Pluto TV, Tubi, and more. Alexa Voice Remote - Search and launch content with your voice. Get to favorite apps quickly with preset buttons. Control power and volume with one remote. Do more with your smart home - View the front door camera without stopping your show using Live View Picture-in-Picture. Ask Alexa to check the weather or dim the lights. Game on - Fluid gameplay and fast-rendering graphics with a 750Mhz GPU. Access popular games with a Luna cloud gaming subscription.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/fire-tv-stick-4k-max-with-alexa-voice-remote/product-reviews/B08MQZXN1X/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (4th Gen) | Smart speaker with Alexa | Twilight Blue", "price": null, "short_description": "Meet the Echo Dot - Our most popular smart speaker with Alexa. The sleek, compact design delivers crisp vocals and balanced bass for full sound. Voice control your entertainment - Stream songs from Amazon Music, Apple Music, Spotify, SiriusXM, and others. Play music, audiobooks, and podcasts throughout your home with multi-room music. Ready to help - Ask Alexa to tell a joke, play music, answer questions, play the news, check the weather, set alarms, and more. Control your smart home - Use your voice to turn on lights, adjust thermostats, and lock doors with compatible devices. Start Routines with your motion - Turn on compatible lights, play your Flash Briefing, or turn on the coffee maker when you walk into the room. Connect with others hands-free - Call friends and family who have the Alexa app or an Echo device. Instantly drop in on other rooms or announce to the whole house that dinner's ready. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic off button.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/All-new-Echo-Dot-Blue/product-reviews/B084J4MZK8/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (4th Gen) | Smart speaker with Alexa | Glacier White", "price": null, "short_description": "Meet the Echo Dot - Our most popular smart speaker with Alexa. The sleek, compact design delivers crisp vocals and balanced bass for full sound. Voice control your entertainment - Stream songs from Amazon Music, Apple Music, Spotify, SiriusXM, and others. Play music, audiobooks, and podcasts throughout your home with multi-room music. Ready to help - Ask Alexa to tell a joke, play music, answer questions, play the news, check the weather, set alarms, and more. Control your smart home - Use your voice to turn on lights, adjust thermostats, and lock doors with compatible devices. Start Routines with your motion - Turn on compatible lights, play your Flash Briefing, or turn on the coffee maker when you walk into the room. Connect with others hands-free - Call friends and family who have the Alexa app or an Echo device. Instantly drop in on other rooms or announce to the whole house that dinner's ready. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic off button.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/all-new-echo-dot/product-reviews/B084J4KNDS/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Kindle Paperwhite (8 GB) – Now with a 6.8\" display and adjustable warm light – Ad-Supported", "price": null, "short_description": "Kindle Paperwhite – Now with a 6.8” display and thinner borders, adjustable warm light, up to 10 weeks of battery life, and 20% faster page turns. Purpose-built for reading – With a flush-front design and 300 ppi glare-free display that reads like real paper, even in bright sunlight. More books in more places – Store thousands of titles, then take them all with you. A single charge via USB-C last weeks, not hours. Easy on the eyes – Now with adjustable warm light to shift screen shade from white to amber. Waterproof reading – Built to withstand accidental immersion in water, so you’re good from the beach to the bath. Find new stories – With Kindle Unlimited, get unlimited access to over 2 million titles, thousands of audiobooks, and more. Go hands-free – Pair with an Audible subscription and Bluetooth headphones or speakers to listen to your story.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/All-new-Kindle-Paperwhite-adjustable-Ad-Supported/product-reviews/B08KTZ8249/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Fire TV Stick Lite with Alexa Voice Remote Lite (no TV controls), HD streaming device", "price": null, "short_description": "Our most affordable Fire TV Stick - Enjoy fast streaming in Full HD. Comes with Alexa Voice Remote Lite. Great for new users - Start streaming with access to over 200,000 free movies and TV episodes from ad-supported streaming apps like IMDb TV, Tubi, Pluto TV, and more. Easy to set up, stays hidden - Plug in behind your TV, turn on the TV, and connect to the internet to get set up. Press and ask Alexa - Use your voice to easily search and launch shows across multiple apps. Endless entertainment - Stream more than 1 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply. Live TV - Watch your favorite live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Listen to music - Stream on Amazon Music, Spotify, Pandora, and others. Subscription fees may apply.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/fire-tv-stick-lite/product-reviews/B07YNLBS7R/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Fire TV Cube, Hands-free streaming device with Alexa, 4K Ultra HD, includes latest Alexa Voice Remote", "price": null, "short_description": "The most powerful Fire TV streaming media player - the ultra-powerful hexa-core processor delivers a fast, fluid 4K streaming experience. Hands-free entertainment - Put down the remote and dive right into your favorites with just your voice. Control the TV with your voice - Control compatible soundbar and A/V receivers, and change live cable or satellite channels with your voice. Just ask Alexa - With the built-in speaker, ask Alexa to check the weather, turn off the lights, and more – even when the TV is off. Cinematic experience - Watch in vibrant 4K Ultra HD with support for Dolby Vision, HDR, HDR10+ and immersive Dolby Atmos audio. Endless entertainment - Stream more than 1 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Subscription fees may apply. Designed to protect your privacy - Built with privacy protections and controls, including a microphone off button that electronically disconnects the microphones. Live and free TV - Watch live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Stream for free with Pluto TV, IMDb TV, YouTube and more. Alexa Voice Remote - Search and launch content with your voice. Get to favorite apps quickly with preset buttons. Control power and volume with one remote. Show more", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Hands-free-streaming-device-Alexa-Ultra/product-reviews/B08XMDNVX6/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (3rd Gen) for $0.99 and 1 month of Amazon Music Unlimited for $7.99 with Auto-renewal - Charcoal", "price": null, "short_description": "Valid for new Echo device customers only. Get unlimited access to 90 million songs. Always ad-free. Our most popular smart speaker with a fabric design. It is our most compact smart speaker that fits perfectly into small spaces. Improved speaker quality - Better speaker quality than Echo Dot Gen 2 for richer and louder sound. Pair with a second Echo Dot for stereo sound. Voice control your music - Stream songs from Amazon Music, Apple Music, Spotify, Sirius XM, and others. Ready to help - Ask Alexa to play music, answer questions, read the news, check the weather, set alarms, control compatible smart home devices, and more. Voice control your smart home - Turn on lights, adjust thermostats, lock doors, and more with compatible connected devices. Connect with others - Call almost anyone hands-free. Instantly drop in on other rooms in your home or make an announcement to every room with a compatible Echo device. Alexa has skills - With tens of thousands of skills and counting, Alexa is always getting smarter and adding new skills like tracking fitness, playing games, and more. Designed to protect your privacy - Built with multiple layers of privacy protections and controls, including a microphone off button that electronically disconnects the microphones. This is a limited time offer of 1 month of Amazon Music Unlimited Individual Plan for $9.99 ($7.99 for Prime members only) and an Echo Dot (3rd Gen) for $0.99, total price of $8.98 ($12.98 for Prime members only). Items must be purchased on a single order. Only first time device owners of an Amazon Echo device are eligible for this promotion. Current Echo device customers and Amazon Music subscribers are not eligible. After the 1-month promotional term, your Amazon Music Subscription will automatically continue at the monthly price of $9.99 ($7.99 for Prime members) plus applicable taxes until you cancel. Offer good while supplies last. Use of Echo Dot is subject to the Alexa and Alexa Device Terms of Use (https://www.amazon.com/gp/help/customer/display.html/ref=s9_acss_bw_cg_dot4usd_md1_w?nodeId=201566380&pf_rd_m=ATVPDKIKX0DER&pf_rd_s=merchandised-search-1&pf_rd_r=743057KXR58T1SPWDAD4&pf_rd_t=101&pf_rd_p=0ac47672-ac69-4431-b7f2-e1764f3613dd&pf_rd_i=20189053011). If you return your Echo product related to this offer, your refund will equal the amount you paid for the product, subject to applicable refund policies. Shipping charges and taxes may apply to the full value of discounted and promotional items. If you cancel your Amazon Music subscription, you will not receive a refund of any fees already paid. Digital content and services may only be available to customers located in the U.S. and are subject to the terms and conditions of Amazon.com (http://amazon.com/) Services LLC. Show more", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/month-Amazon-Unlimited-Auto-renewal-Charcoal/product-reviews/B0873B5ZVQ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Dot (3rd Gen) for $0.99 and 1 month of Amazon Music Unlimited for $7.99 with Auto-renewal - Charcoal", "price": null, "short_description": "Valid for new Echo device customers only. Get unlimited access to 90 million songs. Always ad-free. Our most popular smart speaker with a fabric design. It is our most compact smart speaker that fits perfectly into small spaces. Improved speaker quality - Better speaker quality than Echo Dot Gen 2 for richer and louder sound. Pair with a second Echo Dot for stereo sound. Voice control your music - Stream songs from Amazon Music, Apple Music, Spotify, Sirius XM, and others. Ready to help - Ask Alexa to play music, answer questions, read the news, check the weather, set alarms, control compatible smart home devices, and more. Voice control your smart home - Turn on lights, adjust thermostats, lock doors, and more with compatible connected devices. Connect with others - Call almost anyone hands-free. Instantly drop in on other rooms in your home or make an announcement to every room with a compatible Echo device. Alexa has skills - With tens of thousands of skills and counting, Alexa is always getting smarter and adding new skills like tracking fitness, playing games, and more. Designed to protect your privacy - Built with multiple layers of privacy protections and controls, including a microphone off button that electronically disconnects the microphones. This is a limited time offer of 1 month of Amazon Music Unlimited Individual Plan for $9.99 ($7.99 for Prime members only) and an Echo Dot (3rd Gen) for $0.99, total price of $8.98 ($12.98 for Prime members only). Items must be purchased on a single order. Only first time device owners of an Amazon Echo device are eligible for this promotion. Current Echo device customers and Amazon Music subscribers are not eligible. After the 1-month promotional term, your Amazon Music Subscription will automatically continue at the monthly price of $9.99 ($7.99 for Prime members) plus applicable taxes until you cancel. Offer good while supplies last. Use of Echo Dot is subject to the Alexa and Alexa Device Terms of Use (https://www.amazon.com/gp/help/customer/display.html/ref=s9_acss_bw_cg_dot4usd_md1_w?nodeId=201566380&pf_rd_m=ATVPDKIKX0DER&pf_rd_s=merchandised-search-1&pf_rd_r=743057KXR58T1SPWDAD4&pf_rd_t=101&pf_rd_p=0ac47672-ac69-4431-b7f2-e1764f3613dd&pf_rd_i=20189053011). If you return your Echo product related to this offer, your refund will equal the amount you paid for the product, subject to applicable refund policies. Shipping charges and taxes may apply to the full value of discounted and promotional items. If you cancel your Amazon Music subscription, you will not receive a refund of any fees already paid. Digital content and services may only be available to customers located in the U.S. and are subject to the terms and conditions of Amazon.com (http://amazon.com/) Services LLC. Show more", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/month-Amazon-Unlimited-Auto-renewal-Charcoal/product-reviews/B0873B5ZVQ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Blink Outdoor - wireless, weather-resistant HD security camera, two-year battery life, motion detection, set up in minutes – 2 camera kit", "price": null, "short_description": "Blink Outdoor is a wireless battery-powered HD security camera that helps you monitor your home day or night with infrared night vision. With long-lasting battery life, Outdoor runs for up to two years on two AA lithium batteries (included). Store video clips and photos in the cloud with the Blink Subscription Plan and save events locally to the Blink Sync Module 2 via a USB flash drive (sold separately). Outdoor is built to withstand the elements to help you protect your home inside or out, come rain or shine. Designed so you can set up yourself in minutes. No wiring, no professional installation required. Get motion detection alerts on your phone with the option to customize motion zones in the Blink Home Monitor app so you’re only alerted when you need to be. See, hear, and speak to visitors with live view in real time and two-way audio features on your Blink app. Works with Alexa – use your voice to monitor your home through supported Alexa-enabled devices. Includes two Blink Outdoor cameras and one Sync Module 2. Show more", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Blink-Outdoor-Wireless-Security-Camera-2cam/product-reviews/B086DL32R3/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Amazon Smart Plug, for home automation, Works with Alexa- A Certified for Humans Device", "price": null, "short_description": "Amazon Smart Plug works with Alexa to add voice control to any outlet. Certified for Humans - Struggle-free, tinker-free, stress-free. No patience needed—it's actually simple. Schedule lights, fans, and appliances to turn on and off automatically, or control them remotely when you’re away. Simple to set up and use—plug in, open the Alexa app, and get started in minutes. Compact design keeps your second outlet free. No smart home hub required—set up routines and schedules through the Alexa app. See tips on saving energy and estimate your light’s consumption with the Alexa energy dashboard.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Amazon-smart-plug-works-with-Alexa/product-reviews/B089DR29T6/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Blink Outdoor - wireless, weather-resistant HD security camera, two-year battery life, motion detection, set up in minutes – 3 camera kit", "price": null, "short_description": "Blink Outdoor is a wireless battery-powered HD security camera that helps you monitor your home day or night with infrared night vision. With long-lasting battery life, Outdoor runs for up to two years on two AA lithium batteries (included). Store video clips and photos in the cloud with the Blink Subscription Plan and save events locally to the Blink Sync Module 2 via a USB flash drive (sold separately). Outdoor is built to withstand the elements to help you protect your home inside or out, come rain or shine. Designed so you can set up yourself in minutes. No wiring, no professional installation required. Get motion detection alerts on your phone with the option to customize motion zones in the Blink Home Monitor app so you’re only alerted when you need to be. See, hear, and speak to visitors with live view in real time and two-way audio features on your Blink app. Works with Alexa – use your voice to monitor your home through supported Alexa-enabled devices. Includes three Blink Outdoor cameras and one Sync Module 2. Show more", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Blink-Outdoor-Wireless-Security-Camera-3cam/product-reviews/B086DKSHQ4/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Fire TV Stick Lite with latest Alexa Voice Remote Lite (no TV controls), HD streaming device", "price": null, "short_description": "Our most affordable Fire TV Stick - Enjoy fast streaming in Full HD. Comes with Alexa Voice Remote Lite. Great for new users - Start streaming with access to over 200,000 free movies and TV episodes from ad-supported streaming apps like IMDb TV, Tubi, Pluto TV, and more. Easy to set up, stays hidden - Plug in behind your TV, turn on the TV, and connect to the internet to get set up. Press and ask Alexa - Use your voice to easily search and launch shows across multiple apps. Endless entertainment - Stream more than 1 million movies and TV episodes from Netflix, Prime Video, Disney+, Peacock, and more, plus listen to millions of songs. Live TV - Watch your favorite live TV, news, and sports with subscriptions to SLING TV, YouTube TV, and others. Listen to music - Stream on Amazon Music, Spotify, Pandora, and others. Control your smart home - Ask Alexa to check weather, dim the lights, view live camera feeds, stream music and more.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/fire-tv-stick-lite-latest-alexa-voice-remote-lite/product-reviews/B091G4YP57/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Ring Rechargeable Battery Pack", "price": null, "short_description": "Works with Ring Video Doorbell 3, Video Doorbell 3 Plus, Video Doorbell 4, Peephole Cam, Stick Up Cam Battery (2nd and 3rd Gen), Spotlight Cam Battery, and Smart Lighting Solar Floodlight. Powers your device for up to six months depending on motion and light settings. Includes a quick-release tab to easily change the battery without moving the device.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Ring-Rechargeable-Battery-Pack/product-reviews/B076JKHDQT/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Show 5 (2nd Gen, 2021 release) | Smart display with Alexa and 2 MP camera | Charcoal", "price": null, "short_description": "See your day clearly with Alexa at the ready - Set alarms and timers, check your calendar or the news, make video calls with the 2 MP camera, and stream music or shows - all with your voice. Add Alexa to your nightstand - Ease into the day with a routine that turns compatible lights on gradually. Or wake up to your news update, the weather forecast, and your favorite music. Manage your smart home - Look in when you're away with the built-in camera. Control compatible devices like cameras, lights, and more using the interactive display, your voice, or your motion. Connect with video calling - Use the 2 MP camera to call friends and family who have the Alexa app or an Echo device with a screen. Make announcements to other compatible devices in your home. Be entertained - Ask Alexa to play TV shows and movies via Prime Video, Netflix, and more on the 5.5\" screen. Or stream favorites from Amazon Music, Apple Music, Spotify, and others. Subscriptions for some services required. Put photos on (smart) display - Use Amazon Photos or Facebook to turn your home screen into a digital frame. Designed to protect your privacy - Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic/camera off button and a built-in camera shutter.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Echo-Show-5-2nd-Gen-2021-release/product-reviews/B08J8FFJ8H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Ring Indoor Cam, Compact Plug-In HD security camera with two-way talk, Works with Alexa - White", "price": null, "short_description": "About this item Compact plug-in indoor camera that lets you see, hear and speak to people and pets from your phone, tablet, or select Echo device. Watch over your entire home by connecting one or multiple Indoor Cams to all your Ring devices in the Ring app. With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 60 days, and share videos and photos. With Live View, you can check in on your home any time through the Ring app. Easily setup your Indoor Cam by plugging into a standard outlet and connecting to Wi-Fi. Place on a flat surface or mount to a wall with the versatile mounting bracket. For added peace of mind, pair with Alexa to help you keep an eye on your home.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Ring-Indoor-Compact-Security-Camera/product-reviews/B07Q9VBYV8/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Kindle Paperwhite Signature Edition (32 GB) – With a 6.8\" display, wireless charging, and auto-adjusting front light – Without Ads", "price": null, "short_description": "Get more with Signature Edition – Everything in the Kindle Paperwhite, plus wireless charging, auto-adjusting front light, and 32 GB storage. Purpose-built for reading – With a flush-front design and 300 ppi glare-free display that reads like real paper, even in bright sunlight. More reading time – A single charge via USB-C or compatible Qi wireless charger (sold separately) now lasts up to 10 weeks. Adjustable screen – Now with adjustable warm light and auto-adjusting front light for a personalized reading experience, day or night. More books in more places – Store thousands of titles, then take them all with you. Find new stories – With Kindle Unlimited, get unlimited access to over 2 million titles, thousands of audiobooks, and more. Go hands-free – Pair with an Audible subscription and Bluetooth headphones or speakers to listen to your story.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Introducing-kindle-paperwhite-Signature-Edition/product-reviews/B08B495319/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Kindle - With a Built-in Front Light - Black - Ad-Supported", "price": null, "short_description": "Purpose-built for reading with a 167 ppi glare-free display that reads like real paper, even in direct sunlight. Adjustable brightness lets you read comfortably—indoors and outdoors, day and night. A single battery charge lasts weeks, not hours. 8 GB of storage means thousands of titles on hand all in a compact size. Read distraction-free. Highlight passages, look up definitions, translate words, and adjust text size—without ever leaving the page. With Kindle Unlimited, get unlimited access to over 2 million titles, thousands of audiobooks, and more. Enjoy audiobooks with Audible. Pair with Bluetooth headphones or speakers to switch seamlessly between reading and listening.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Kindle-Now-with-Built-in-Front-Light/product-reviews/B07978J597/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Blink Mini – Compact indoor plug-in smart security camera, 1080 HD video, night vision, motion detection, two-way audio, Works with Alexa – 1 camera", "price": null, "short_description": "1080P HD indoor, plug-in security camera with motion detection and two way audio that lets you monitor the inside of your home day and night. Get alerts on your smartphone whenever motion is detected or customize motion detection zones so you can see what matters most. Store events conveniently and securely in the cloud with a 30-day free trial of the Blink Subscription Plan or locally with the Sync Module 2 and a USB flash drive (USB sold separately). See, hear, and speak to people and pets in your home on your smartphone with Blink Mini’s live view and two-way audio features (live view is not continuous). Sets up in minutes – just plug in the camera, connect it to wifi, and add it to your Blink app. For additional ease of use, pair Blink Mini with a supported Alexa-enabled device to engage live view, and arm and disarm your camera, and more using just your voice.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Blink-Mini-plug-security-detection/product-reviews/B07X6C9RMF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Made for Amazon SanDisk 128GB microSD Memory Card for Fire Tablets and Fire -TV", "price": null, "short_description": "This fits your . Make sure this fits by entering your model number. P.when(\"ReplacementPartsBulletLoader\").execute(function(module){ module.initializeDPX(); }) Exclusive “Made for Amazon” SD memory card - The only one tested and certified to work with your Fire Tablet and Fire TV Load your Fire Tablet with more fun - By adding space for additional photos, music and movies Download your apps and games directly to the SD card Class 10 performance for Full HD (1080p) video recording and playback Designed to perform multiple simultaneous activities with no lag or delay", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": "", "sales_rank": null, "link_to_all_reviews": "/SanDisk-micro-Memory-Card-Tablets/product-reviews/B013TMNPBQ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Ring Chime", "price": null, "short_description": "Chime box to hear notifications for your Ring cameras and doorbells. Hear real-time notifications when your connected cameras and doorbells detect motion, or when someone rings your doorbell. Easily set up by plugging into a standard outlet and connecting via wifi. Choose from a variety of chime tones, adjust the volume to your ideal setting, and temporarily snooze alerts all from the Ring app. Connectivity: 802.11 b/g/n wifi connection 2.4 GHz.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Ring-Chime/product-reviews/B09L45VFCN/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Show 8 -- HD smart display with Alexa – stay connected with video calling - Charcoal", "price": null, "short_description": "Alexa can show you more - With an 8\" HD screen and stereo sound, Alexa can help manage your day at a glance. Connect with video calling and messaging - Call friends and family who have the Alexa app or an Echo device with a screen. Make announcements to other devices in your home. Be entertained - Ask Alexa to show you movie trailers, TV shows, movies, or the news. Or listen to radio stations, podcasts, and audiobooks. Control your smart home - Voice control compatible devices or manage them on the easy-to-use display. Ask Alexa to show you security cameras, control lights, and adjust thermostats. Create morning routines to start your day. Made to fit your life - Get daily recipes and cook along hands-free with step-by-step instructions. Easily update to-do lists and calendars. Glance at weather and traffic on your way out. Put your memories on display - Use Amazon Photos & Alexa for a picture-perfect pairing. You can turn your home screen into a digital frame, share your favorites with friends and family, and even take photos. Plus, Prime members get unlimited photo storage. Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic/camera off button and a built-in camera shutter.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Echo-Show-8/product-reviews/B07PF1Y28C/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Fire 7 Kids tablet, 7\" Display, ages 3-7, 16 GB, Blue Kid-Proof Case", "price": null, "short_description": "2-year worry-free guarantee: if it breaks, return it and we'll replace it for free. Over 20 million kids (and their parents) have enjoyed Amazon Kids+ service. Amazon Kids parental controls allow you to set educational goals, create time limits, and filter content. The included 1 year of Amazon Kids+ gives your kids access to over 20,000 apps, games, books, videos, audiobooks, and educational content from PBS Kids, Nickelodeon, Disney, and more. Your subscription will then automatically renew every month starting at just $2.99 per month plus applicable tax. You may cancel at any time by visiting the Amazon Parent Dashboard or contacting Customer Service. Parents can give kids access to more apps like Netflix, Minecraft, and Zoom via the Amazon Parent Dashboard. Amazon Kids+ includes thousands of Spanish language books, videos, apps, games, and audiobooks. Save up to $89 on a Fire 7 Tablet (not a toy) for kids 3-7, 1 year of Amazon Kids+, a Kid-Proof Case with built-in stand, and 2-year worry-free guarantee, versus items purchased separately. Stream through Wi-Fi or view downloaded content on the go with 16 GB of internal storage and up to 7 hours of reading, browsing the web, watching video, and listening to music. Add a microSD card for up to 512 GB of expandable storage.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Fire-7-Kids-Edition-Tablet/product-reviews/B07H8WS1FT/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
{"name": "Echo Show 8 (2nd Gen, 2021 release) | HD smart display and stereo sound with Alexa |  Charcoal", "price": null, "short_description": "Alexa can show you even more - 8” HD touchscreen, adaptive color, and stereo speakers bring entertainment to life. Make video calls with a 13 MP camera that uses auto-framing to keep you centered. Stay in frame - Make video calls with a new camera that frames and centers automatically. Simply ask Alexa to call your contacts. Make life easier at home - Glance at your calendars and reminders. Get daily recipe ideas and cook along hands-free with step-by-step instructions. Use your voice to set timers, update lists, and see news or traffic updates. Manage your smart home - Look in when you're away with the built-in camera. Control compatible devices like cameras, lights, and more using the interactive display, your voice, or your motion. Be entertained - Enjoy TV shows and movies in HD and stereo with Prime Video, Netflix, and more. Or ask Alexa to stream Amazon Music, Apple Music, or Spotify. Put your memories on display - Use Amazon Photos to turn your home screen into a digital frame. Adaptive color helps your favorite photos look great in any light. Designed to protect your privacy - Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic/camera off button and a built-in camera shutter.", "images": null, "rating": null, "number_of_reviews": null, "variants": null, "product_description": null, "sales_rank": null, "link_to_all_reviews": "/Echo-Show-8-2nd-Gen-2021-release/product-reviews/B084DCJKSL/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}
